ERP DEV.WMS/src/Catalogs/вмс_ПочтовыеРассылки/вмс_ПочтовыеРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_ПочтовыеРассылки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.КвазиСсылки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрПечати</name>
    <type>
      <types>CatalogRef.КвазиСсылки</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Свойства</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>CatalogRef.КвазиСсылки</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормыОтправки</name>
    <attributes>
      <name>ПечатнаяФорма</name>
      <type>
        <types>CatalogRef.КвазиСсылки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКоманды</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_ПочтовыеРассылки/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция СформироватьФормыОтправки(ПочтоваяРассылка, знач ПараметрПечати=Неопределено) Экспорт

	МассивРезультатов = Новый Массив;
	
	Если ПараметрПечати = Неопределено Тогда
		ПараметрПечати = ПочтоваяРассылка.ПараметрПечати;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрПечати) = Тип("СправочникСсылка.КвазиСсылки") Тогда
		ПараметрПечати = вмс_Обмен_с_КИС_ВызовСервера.ПолучитьСсылкуИзКвазиСсылки(ПараметрПечати)
	КонецЕсли;
	
	ОбъектыНазначения = Новый Массив;
	ОбъектыНазначения.Добавить(ПараметрПечати);
	ПараметрыИсточника = Новый Структура;
	ПараметрыИсточника.Вставить("ОбъектыНазначения", ОбъектыНазначения);
	
	Для Каждого СтрокаПечатнойФормы Из ПочтоваяРассылка.ФормыОтправки Цикл
		ПечатнаяФорма = СтрокаПечатнойФормы.ПечатнаяФорма;
		Если Не ЗначениеЗаполнено(ПечатнаяФорма) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ПечатнаяФорма) = Тип("СправочникСсылка.КвазиСсылки") Тогда
			ПечатнаяФорма = вмс_Обмен_с_КИС_ВызовСервера.ПолучитьСсылкуИзКвазиСсылки(ПечатнаяФорма)
		КонецЕсли;
		
		ПараметрыИсточника.Вставить("ИдентификаторКоманды", СтрокаПечатнойФормы.ИдентификаторКоманды);
		КоллекцияПечатныхФорм = Неопределено;   
		
		// ТУ_Кулалаев Е.С ++ 31.05.2024 17:59:26 
		// Рефакторинг: Заменил вмс_Печать на вмс_Печать
		
		Результат = вмс_Печать.ПечатьПоВнешнемуИсточнику(ПечатнаяФорма, ПараметрыИсточника, КоллекцияПечатныхФорм);
		Для Каждого СтрокаТабличногоДокумента Из КоллекцияПечатныхФорм Цикл
			Результат = СтрокаТабличногоДокумента.ТабличныйДокумент;
			Если Результат <> Неопределено Тогда
				МассивРезультатов.Добавить(Результат);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивРезультатов;
	
КонецФункции

Функция СформироватьПараметрыЭлектронныхПисемПоФормамОтправки(ПочтоваяРассылка, ФормыОтправки) Экспорт
	
	ЭП = вмс_ЭлектроннаяПочтаКлиентСервер;
	
	ПараметрыПисем = Новый Массив;
	Для Каждого ФормаОтправки Из ФормыОтправки Цикл
		
		Если ЭП.ЭтоПараметрыЭлектронногоПисьма(ФормаОтправки) Тогда
			
			ПараметрыПисьма = ФормаОтправки;
			
		Иначе
			
			ПараметрыПисьма = ЭП.ПолучитьПараметрыЭлектронногоПисьма();
			Если ТипЗнч(ФормаОтправки) = Тип("ДокументHTML") Тогда
				ТекстHTML = вмс_РаботаСHTML.ПолучитьТекстДокументаHTML(ФормаОтправки);
				ПараметрыПисьма.Тело = ТекстHTML;
				ПараметрыПисьма.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
			ИначеЕсли ТипЗнч(ФормаОтправки) = Тип("ТабличныйДокумент") Тогда
				
				ДанныеHTML = вмс_РаботаСHTML.ПолучитьДанныеHTMLИзТабличногоДокумента(ФормаОтправки);
				вмс_ЭлектроннаяПочтаКлиентСервер.СформироватьВложенияЭлектронногоПисьмаПоДаннымHTML(ДанныеHTML, ПараметрыПисьма);
				ТекстHTML = вмс_РаботаСHTML.ПолучитьТекстДанныхHTML(ДанныеHTML);
				ПараметрыПисьма.Тело = ТекстHTML;
				ПараметрыПисьма.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
				ПараметрыПисьма.Вставить("ОбрабатыватьТексты", Ложь);
				
			ИначеЕсли ТипЗнч(ФормаОтправки) = Тип("Строка") Тогда
				ПараметрыПисьма.Тело = ФормаОтправки;
			КонецЕсли;
			
			ПараметрыПисьма.Тема = ПочтоваяРассылка.Тема;

		КонецЕсли;
		
		Для Каждого СтрокаПолучателя Из ПочтоваяРассылка.Получатели Цикл
			ЭП.ДобавитьПолучателяПисьма(ПараметрыПисьма, СтрокаПолучателя.Адрес, СтрокаПолучателя.Имя);
		КонецЦикла;
		
		ПараметрыПисем.Добавить(ПараметрыПисьма);
		
	КонецЦикла;
	
	Возврат ПараметрыПисем;
	
КонецФункции

Функция Отправить(ПочтоваяРассылка, ПараметрПечати=Неопределено) Экспорт

	ФормыОтправки = СформироватьФормыОтправки(ПочтоваяРассылка, ПараметрПечати);
	
	ПараметрыПисем = СформироватьПараметрыЭлектронныхПисемПоФормамОтправки(ПочтоваяРассылка, ФормыОтправки);
	
	УчетнаяЗапись = вмс_Обмен_с_КИС_ВызовСервера.ПолучитьСсылкуИзКвазиСсылки(ПочтоваяРассылка.УчетнаяЗапись);

	Письма = Новый Массив;
	Для Каждого ПараметрыПисьма Из ПараметрыПисем Цикл
		Письмо = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыПисьма);
		Письма.Добавить(Письмо);
	КонецЦикла;
	РаботаСПочтовымиСообщениями.ОтправитьПисьма(УчетнаяЗапись, Письма);
	
КонецФункции

#КонецЕсли
#КонецЕсли
